In [97]:
from faker import Faker
import pandas as pd
import numpy as np

In [98]:
# Initialize Faker
my_fake = Faker()

In [99]:
# Generate fake data for Customers table
customers_schema = []
for i in range(1, 750):  
    customers = {
        'Customer_ID': i,
        'FirstName': my_fake.first_name(),
        'LastName': my_fake.last_name(),
        'City': my_fake.city(),
        'State': my_fake.state(),
        'Country': my_fake.country()
    }
    customers_schema.append(customers)

In [100]:
# Generate fake data for Orders table
orders_schema = []
for i in range(1, 750):  
    orders = {
        'Order_ID': i,
        'Customer_ID': np.random.randint(1, 750),
        'Payment_ID': i,
        'Order_Date': my_fake.date_between(start_date='-1y', end_date='now'),
        'Shipper_ID': np.random.randint(1, 100),  
        'Delivery_Date': my_fake.date_between(start_date='-1y', end_date='now'),  
    }
    orders_schema.append(orders)

In [101]:
# Generate fake data for OrderDetails table
OrderDetails_schema = []
for i in range(1, 750):  
    num_of_products = np.random.randint(1, 11)
    for _ in range(num_of_products):
        orderdetails = {
            'Order_ID': i,
            'Product_ID': np.random.randint(1, 750),
            'Quantity': np.random.randint(1, 10),  
            'Supplier_ID': np.random.randint(1, 201), 
            'UnitPrice': round(np.random.uniform(50, 500), 2)  
        }
        OrderDetails_schema.append(orderdetails)

In [102]:
# Product categories and brands
product_brands = {
    'CPVC Pipes':['Ashirvad Pipes','Astral Pipes','Finolex Industries','Prince Pipes','Supreme Pipes'],
    'UPVC Pipes':['Apollo Pipes','Ashirvad Pipes','Finolex Industries','Prince Pipes','Supreme Pipes'],
    'SWR Pipes':['Ashirvad Pipes','Astral Pipes','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'Underground Pipes':['Astral Pipes','Jain Irrigation Systems Ltd.','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'Ball Valves':['Ashirvad Pipes','Astral Pipes','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'Riser Pipes':['Cera Sanitaryware Ltd.','Jaquar Group','Kohler India Corporation Pvt. Ltd.'],
    'HDPE Pipes':['Astral Pipes','Finolex Industries','Jain Irrigation Systems Ltd.','Prince Pipes','Supreme Industries Ltd.'],
    'Casing Pipes':['Ashirvad Pipes','Jain Irrigation Systems Ltd.','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'Pressure Pipes':['Ashirvad Pipes','Jain Irrigation Systems Ltd.','Finolex Industries','Supreme Industries Ltd.','Prince Pipes'],
    'Suction Pipes':['Ashirvad Pipes','Jain Irrigation Systems Ltd.','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'Duct Pipes':['Ashirvad Pipes','Jain Irrigation Systems Ltd.','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'Steel Wire Reinforced Pipes':['Ashirvad Pipes','Jain Irrigation Systems Ltd.','Finolex Industries','Prince Pipes','Supreme Industries Ltd.'],
    'PTMP Taps and Fittings Pipes':['Cera Sanitaryware Ltd.','Kohler India Corporation Pvt. Ltd.','Hindware','Jaquar Group','Parryware'],
    'Flusing Cistern':['Cera Sanitaryware Ltd.','Kohler India Corporation Pvt. Ltd.','Hindware','Jaquar Group','Parryware'],
    'Bathroom Accessories Pipes':['Cera Sanitaryware Ltd.','Kohler India Corporation Pvt. Ltd.','Hindware','Jaquar Group','Parryware']
}

In [103]:
# Generate fake data for Products table
products_schema = []
for i in range(1, 750):  
    Types = np.random.choice(list(product_brands.keys()))
    brands = np.random.choice(product_brands[Types])
    products = {
        'Product_ID': i,
        'Product': Types,
        'Brand': brands,
        'Sale_Price': round(np.random.uniform(100, 1000), 2),
        'Category_ID': np.random.randint(1, 17),  
        'Supplier_ID': np.random.randint(1, 201)  
    }
    products_schema.append(products)

In [104]:
# Generate fake data for Categories table
categories_schema = []
for i in range(1, 17):  # 
    categories = {
        'Category_ID': i,
        'Category': f'Categories{i}',
    }
    categories_schema.append(categories)

In [105]:
# Generate fake data for Shippers table
shippers_schema = []
for i in range(1, 100):  
    shippers = {
        'Shipper_ID': i,
        'Shipper': my_fake.company()
    }
    shippers_schema.append(shippers)

In [106]:
# Generate fake data for Suppliers table
suppliers_schema = []
for i in range(1, 201):  
    suppliers = {
        'Supplier_ID': i,
        'CompanyName': my_fake.company(),
        'SupplierName': my_fake.name(),
    }
    suppliers_schema.append(suppliers)

In [107]:
# Generate fake data for Payments table
payments_schema = []
Types = ['Cash','Credit Card', 'Debit Card','Net Banking', 'PayPal']  
for i in range(1, 750):  
    payments = {
        'PaymentID': i,
        'PaymentMethod': np.random.choice(Types) 
    }
    payments_schema.append(payments)

In [108]:
# Convert data to pandas DataFrame
customer_df = pd.DataFrame(customers_schema)
order_df = pd.DataFrame(orders_schema)
orderdetail_df = pd.DataFrame(OrderDetails_schema)
product_df = pd.DataFrame(products_schema)
categories_df = pd.DataFrame(categories_schema)
shipper_df = pd.DataFrame(shippers_schema)
supplier_df = pd.DataFrame(suppliers_schema)
payment_df = pd.DataFrame(payments_schema)

In [109]:
# Data Cleaning

# Check for missing values
print("Missing values in Customers table:")
print(customer_df.isnull().sum())

Missing values in Customers table:
Customer_ID    0
FirstName      0
LastName       0
City           0
State          0
Country        0
dtype: int64

In [110]:
# Check for missing values
print("Missing values in OrderDetails table:")
print(orderdetail_df.isnull().sum())

Missing values in OrderDetails table:
Order_ID       0
Product_ID     0
Quantity       0
Supplier_ID    0
UnitPrice      0
dtype: int64

In [111]:
# Check for missing values
print("Missing values in Products table:")
print(product_df.isnull().sum())

Missing values in Products table:
Product_ID     0
Product        0
Brand          0
Sale_Price     0
Category_ID    0
Supplier_ID    0
dtype: int64

In [112]:
# Check for missing values
print("Missing values in Categoriess table:")
print(categories_df.isnull().sum())

Missing values in Categoriess table:
Category_ID    0
Category       0
dtype: int64

In [113]:
# Check for missing values
print("Missing values in Shippers table:")
print(shipper_df.isnull().sum())

Missing values in Shippers table:
Shipper_ID    0
Shipper       0
dtype: int64

In [114]:
# Check for missing values
print("Missing values in Suppliers table:")
print(supplier_df.isnull().sum())

Missing values in Suppliers table:
Supplier_ID     0
CompanyName     0
SupplierName    0
dtype: int64

In [115]:
# Check for missing values
print("Missing values in Payments table:")
print(payment_df.isnull().sum())

Missing values in Payments table:
PaymentID        0
PaymentMethod    0
dtype: int64

In [116]:
# check shape of data before cleaning
print(customer_df.shape)
print(order_df.shape)
print(orderdetail_df.shape)
print(product_df.shape)
print(categories_df.shape)
print(shipper_df.shape)
print(supplier_df.shape)
print(payment_df.shape)

(749, 6)
(749, 6)
(4028, 5)
(749, 6)
(16, 2)
(99, 2)
(200, 3)
(749, 2)

In [117]:
# Remove duplicate rows
customer_df = customer_df.drop_duplicates()
order_df = order_df.drop_duplicates()
orderdetail_df = orderdetail_df.drop_duplicates()
product_df = product_df.drop_duplicates()
categories_df = categories_df.drop_duplicates()
shipper_df = shipper_df.drop_duplicates()
supplier_df = supplier_df.drop_duplicates()
payment_df = payment_df.drop_duplicates()

In [118]:
# check shape of data after cleaning
print(customer_df.shape)
print(order_df.shape)
print(orderdetail_df.shape)
print(product_df.shape)
print(categories_df.shape)
print(shipper_df.shape)
print(supplier_df.shape)
print(payment_df.shape)

(749, 6)
(749, 6)
(4028, 5)
(749, 6)
(16, 2)
(99, 2)
(200, 3)
(749, 2)

In [119]:
# Check for data types
print(customer_df.dtypes)
print(order_df.dtypes)
print(orderdetail_df.dtypes)
print(product_df.dtypes)
print(categories_df.dtypes)
print(shipper_df.dtypes)
print(supplier_df.dtypes)
print(payment_df.dtypes)

Customer_ID     int64
FirstName      object
LastName       object
City           object
State          object
Country        object
dtype: object
Order_ID          int64
Customer_ID       int64
Payment_ID        int64
Order_Date       object
Shipper_ID        int64
Delivery_Date    object
dtype: object
Order_ID         int64
Product_ID       int64
Quantity         int64
Supplier_ID      int64
UnitPrice      float64
dtype: object
Product_ID       int64
Product         object
Brand           object
Sale_Price     float64
Category_ID      int64
Supplier_ID      int64
dtype: object
Category_ID     int64
Category       object
dtype: object
Shipper_ID     int64
Shipper       object
dtype: object
Supplier_ID      int64
CompanyName     object
SupplierName    object
dtype: object
PaymentID         int64
PaymentMethod    object
dtype: object

In [120]:
customer_df.head()

   Customer_ID  FirstName   LastName          City       State         Country
0            1   Benjamin       Shaw   Wallaceview  California         Belgium
1            2   Michelle  Armstrong  Port Tiffany        Iowa            Fiji
2            3  Katherine       Horn    Amandaside     Wyoming            Chad
3            4    Jeffrey   Williams    Lake Mario     Alabama  Western Sahara
4            5    Matthew      Poole     Wandatown  New Mexico          France

In [121]:
order_df.head()

   Order_ID  Customer_ID  Payment_ID  Order_Date  Shipper_ID Delivery_Date
0         1          749           1  2024-05-07          47    2024-01-28
1         2          278           2  2023-09-19          52    2023-08-31
2         3          376           3  2024-02-12          59    2023-09-09
3         4          374           4  2023-10-03          85    2023-08-22
4         5          549           5  2024-05-03          33    2023-09-09

In [122]:
orderdetail_df.head()

   Order_ID  Product_ID  Quantity  Supplier_ID  UnitPrice
0         1         577         3          190      57.46
1         1          17         5           81     351.25
2         1          84         1           42     176.62
3         1         593         1          198     418.27
4         1         608         4           29     174.54

In [123]:
product_df.head()

,Product_ID,Product,Brand,Sale_Price,Category_ID,Supplier_ID
0,1,HDPE Pipes,Jain Irrigation Systems Ltd.,501.51,16,35
1,2,Flusing Cistern,Kohler India Corporation Pvt. Ltd.,358.11,14,61
2,3,SWR Pipes,Ashirvad Pipes,235.05,2,26
3,4,SWR Pipes,Prince Pipes,423.89,10,32
4,5,Ball Valves,Prince Pipes,210.20,5,65

In [124]:
categories_df.head()

   Category_ID     Category
0            1  Categories1
1            2  Categories2
2            3  Categories3
3            4  Categories4
4            5  Categories5

In [125]:
shipper_df.head()

   Shipper_ID                     Shipper
0           1                 Bennett LLC
1           2  Martin, Jenkins and Barker
2           3              Jennings Group
3           4                 Taylor-Reed
4           5              Ortiz and Sons

In [126]:
supplier_df.head()

   Supplier_ID                    CompanyName     SupplierName
0            1              Whitaker-Reynolds  Victoria Turner
1            2  Summers, Parsons and Mcdaniel     Jeremy Stark
2            3               Mullen-Fernandez  Amanda Sullivan
3            4       Jackson, Meyers and Ross    Kelly Gilbert
4            5       Gonzalez, Bates and Boyd   Patrick Harris

In [127]:
payment_df.head()

   PaymentID PaymentMethod
0          1    Debit Card
1          2   Net Banking
2          3    Debit Card
3          4   Credit Card
4          5          Cash

In [128]:
# Save data to xlsx files
customer_df.to_csv('customers.csv', index=False)
order_df.to_csv('orders.csv', index=False)
orderdetail_df.to_csv('orderdetails.csv', index=False)
product_df.to_csv('products.csv', index=False)
categories_df.to_csv('categories.csv', index=False)
shipper_df.to_csv('shippers.csv', index=False)
supplier_df.to_csv('suppliers.csv', index=False)
payment_df.to_csv('payments.csv', index=False)